---
kind: method
id: M:Autodesk.Revit.Creation.Application.NewXYZ(Autodesk.Revit.DB.XYZ)
source: html/c733d83d-fff8-6324-4127-b089e88c37f5.htm
---
# Autodesk.Revit.Creation.Application.NewXYZ Method

Creates a XYZ object by copying the supplied XYZ object.

## Syntax (C#)
```csharp
public XYZ NewXYZ(
	XYZ xyz
)
```

## Parameters
- **xyz** (`Autodesk.Revit.DB.XYZ`) - The supplied XYZ object